Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [30]:
# import pandas as pd
import pandas as pd
 
# import numpy as np
import numpy as np
 
# simple array
data = np.array([4, 8, 15, 16, 23, 42 ])
 
ser = pd.Series(data)
print(ser)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [31]:
data1 = [i**2 for i in range(1,11)]
pd.Series(data1)

0      1
1      4
2      9
3     16
4     25
5     36
6     49
7     64
8     81
9    100
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

Name Alice Bob Claire

Age 25 30 27

Gender Female Male Female

In [32]:
data3 = [["Name","Age","Gender"],
         ["Alice", "Bob" ,"Claire"],
         [25, 30, 27],
         ["Female", "Male", "Female"]]

In [33]:
data4 = pd.DataFrame(data3)
data4

        0     1       2
0    Name   Age  Gender
1   Alice   Bob  Claire
2      25    30      27
3  Female  Male  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Series can only contain single list with index, whereas dataframe can be made of more than one series or we can say that a dataframe is a collection of series that can be used to analyse the data.

Pandas Series is One-dimensional,Homogenous (Series elements must be of the same data type),Size-immutable (Once created, the size of a Series object cannot be changed).

Whereas Pandas DataFrame are Two-dimensional,Heterogenous (DataFrame elements can have different data types),Size-mutable
(Elements can be dropped or added in an existing DataFrame)

In [34]:
#this is dataframe
data4

        0     1       2
0    Name   Age  Gender
1   Alice   Bob  Claire
2      25    30      27
3  Female  Male  Female

In [35]:
#this is series
data4[0]

0      Name
1     Alice
2        25
3    Female
Name: 0, dtype: object

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

Some common functions are :
1.READ DATA:We can read data in pandas data frame as read_csv()
2.Head and Tail:To see the data frame we can use df.head(). Head returns the first rows, if no input is given it will always show above 5 rows. In contrast to see below rows, we can use df.tail().
3.memory_usage(): It returns a Pandas Series having the memory usage of each column (in bytes) in a Pandas DataFrame.
4.loc[:] :It helps to access a group of rows and columns in a dataset, a slice of the dataset, as per our requirement.
5.Describe(): Used to generate descriptive statistics of the data in a Pandas DataFrame or Series.

In [36]:
data4.memory_usage()

Index    128
0         32
1         32
2         32
dtype: int64

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Both Series and DataFrame are mutable in nature, while Panel is now deprecated in the latest version of Pandas, and its functionalities are replaced by other data structures like MultiIndex and Panel4D.

In Pandas, the term mutable refers to the ability to modify the data elements of an object after it has been created. Both Series and DataFrame objects can be modified after creation by adding, deleting, or updating rows or columns. However, the object's index and column labels can also be modified, which makes them mutable in nature.

For instance, to modify a DataFrame's column, we can use the following syntax:

df['column_name'] = new_values

Similarly, to modify a Series, we can use the following syntax:

series_name[index] = new_value

However, it is essential to note that some operations, such as reindexing, can create a new object instead of modifying the existing one.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In Pandas, we can create a DataFrame using multiple Series. Here is an example of how to create a DataFrame using two Series:

In [37]:
import pandas as pd

# create first series
names = pd.Series(['John', 'Bob', 'Alice'])

# create second series
ages = pd.Series([30, 25, 35])

#create third series

gender = pd.Series(["Male","Male","Female"])

# create a DataFrame using the two series
df = pd.DataFrame({'Name': names, 'Age': ages})

# display the DataFrame
df

    Name  Age
0   John   30
1    Bob   25
2  Alice   35